In [1]:
import pandas as pd 
import sidetable as stb
import numpy as np

pd.options.display.max_columns = None

In [2]:
df = pd.read_csv('data/supermarket_sales - Sheet1.csv')
df.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [3]:
#Cambiamos el nombre de las columnas para unificarlas

df.rename(columns = {col: col.replace(' ', '_').lower() for col in df.columns}, inplace = True)

In [4]:
df.head(2)

,invoice_id,branch,city,customer_type,gender,product_line,unit_price,quantity,tax_5%,total,date,time,payment,cogs,gross_margin_percentage,gross_income,rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6

In [5]:
#Eliminamos la columna 'gross margin percentage' ya que nos da el mismo valor para todos los registros y no nos aporta información
#Eliminamos 'branch' porque es redundante con la columna city (cada supermercado corresponde a una ciudad).

df = df.drop(columns = ['branch', 'gross_margin_percentage'])
df.head(2)

,invoice_id,city,customer_type,gender,product_line,unit_price,quantity,tax_5%,total,date,time,payment,cogs,gross_income,rating
0,750-67-8428,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,26.1415,9.1
1,226-31-3081,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,3.8200,9.6

In [6]:
df.columns

Index(['invoice_id', 'city', 'customer_type', 'gender', 'product_line',
       'unit_price', 'quantity', 'tax_5%', 'total', 'date', 'time', 'payment',
       'cogs', 'gross_income', 'rating'],
      dtype='object')

In [7]:
df.shape

(1000, 15)

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
unit_price,1000.0,55.672130,26.494628,10.0800,32.875000,55.230,77.93500,99.96
quantity,1000.0,5.510000,2.923431,1.0000,3.000000,5.000,8.00000,10.00
tax_5%,1000.0,15.379369,11.708825,0.5085,5.924875,12.088,22.44525,49.65
total,1000.0,322.966749,245.885335,10.6785,124.422375,253.848,471.35025,1042.65
cogs,1000.0,307.587380,234.176510,10.1700,118.497500,241.760,448.90500,993.00
gross_income,1000.0,15.379369,11.708825,0.5085,5.924875,12.088,22.44525,49.65
rating,1000.0,6.972700,1.718580,4.0000,5.500000,7.000,8.50000,10.00

In [9]:
df.describe(include= "O").T

              count unique                  top freq
invoice_id     1000   1000          750-67-8428    1
city           1000      3               Yangon  340
customer_type  1000      2               Member  501
gender         1000      2               Female  501
product_line   1000      6  Fashion accessories  178
date           1000     89             2/7/2019   20
time           1000    506                19:48    7
payment        1000      3              Ewallet  345

In [10]:
# chequeamos tipo

df.dtypes

invoice_id        object
city              object
customer_type     object
gender            object
product_line      object
unit_price       float64
quantity           int64
tax_5%           float64
total            float64
date              object
time              object
payment           object
cogs             float64
gross_income     float64
rating           float64
dtype: object

In [11]:
# extraemos información sobre nulos

df.stb.missing()

               missing  total  percent
invoice_id           0   1000      0.0
city                 0   1000      0.0
customer_type        0   1000      0.0
gender               0   1000      0.0
product_line         0   1000      0.0
unit_price           0   1000      0.0
quantity             0   1000      0.0
tax_5%               0   1000      0.0
total                0   1000      0.0
date                 0   1000      0.0
time                 0   1000      0.0
payment              0   1000      0.0
cogs                 0   1000      0.0
gross_income         0   1000      0.0
rating               0   1000      0.0

In [12]:
# comprobar duplicados

df.duplicated().sum()

0

In [13]:
# df numéricas:

df_num = df.select_dtypes(include= ["float64", "int64"])
df_num.sample(3)

     unit_price  quantity  tax_5%    total    cogs  gross_income  rating
824       60.08         7  21.028  441.588  420.56        21.028     4.5
402       13.98         1   0.699   14.679   13.98         0.699     9.8
87        49.38         7  17.283  362.943  345.66        17.283     7.3

In [14]:
# calcular outliers:

def detectar_outliers(lista_columnas, dataframe):
    dicc_indices = {} 
    
    for col in lista_columnas:
       
        Q1 = np.nanpercentile(dataframe[col], 25)
        Q3 = np.nanpercentile(dataframe[col], 75)
        
        IQR = Q3 - Q1
       
        outlier_step = 1.5 * IQR
 
        outliers_data = dataframe[(dataframe[col] < Q1 - outlier_step) | (dataframe[col] > Q3 + outlier_step)]
        if outliers_data.shape[0] > 0: 
            dicc_indices[col] = (list(outliers_data.index)) 
    return dicc_indices

In [15]:
lista_columnas = list(df_num.columns)

In [16]:
detectar_outliers(lista_columnas, df)

{'tax_5%': [166, 167, 350, 357, 422, 557, 699, 792, 996],
 'total': [166, 167, 350, 357, 422, 557, 699, 792, 996],
 'cogs': [166, 167, 350, 357, 422, 557, 699, 792, 996],
 'gross_income': [166, 167, 350, 357, 422, 557, 699, 792, 996]}

In [17]:
#Guardamos el dataframe modificado

df.to_csv('data/supermarket_1.csv')

### Estas son las explicaciones de las variables

    Branch: Branch of supercenter (3 branches are available identified by A, B and C).

    City: Location of supercenters

    Customer type: Type of customers, recorded by Members for customers using member card and Normal for without member card.

    Gender: Gender type of customer
    
    Product line: General item categorization groups - Electronic accessories, Fashion accessories, Food and beverages, Health and beauty, Home and lifestyle, Sports and travel

    Unit price: Price of each product in $

    Quantity: Number of products purchased by customer

    Tax: 5% tax fee for customer buying

    Total: Total price including tax

    Date: Date of purchase (Record available from January 2019 to March 2019)

    Time: Purchase time (10am to 9pm)

    Payment: Payment used by customer for purchase (3 methods are available – Cash, Credit card and Ewallet)

    COGS: Cost of goods sold

    Gross margin percentage: Gross margin percentage

    Gross income: Gross income

    Rating: Customer stratification rating on their overall shopping experience (On a scale of 1 to 10)